In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')

In [3]:
df= pd.read_excel(r"C:\Users\SqyUser\Desktop\Python\8 New Project data cleaning n Analysis\EDA\flight_price.xlsx")

In [5]:
df.head(5)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [6]:
df.sample(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
3783,Jet Airways,6/06/2019,Delhi,Cochin,DEL → ATQ → BOM → COK,20:00,04:25 07 Jun,8h 25m,2 stops,In-flight meal not included,15318
1826,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,06:00,08:45,2h 45m,non-stop,No info,4777

In [7]:
df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [9]:
df.shape

(10683, 11)

In [10]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [12]:
df['Date_of_Journey']

0        24/03/2019
1         1/05/2019
2         9/06/2019
3        12/05/2019
4        01/03/2019
            ...
10678     9/04/2019
10679    27/04/2019
10680    27/04/2019
10681    01/03/2019
10682     9/05/2019
Name: Date_of_Journey, Length: 10683, dtype: object

In [13]:
'Ajay/Kumar'.split("/")

['Ajay', 'Kumar']

In [14]:
'Ajay/Kumar'.split("/")[1]

'Kumar'

In [17]:
df['date'] = df['Date_of_Journey'].str.split("/").str[0]
df["Month"] = df['Date_of_Journey'].str.split("/").str[1]
df["Year"] = df['Date_of_Journey'].str.split("/").str[2]

In [19]:
df["date"]

0        24
1         1
2         9
3        12
4        01
         ..
10678     9
10679    27
10680    27
10681    01
10682     9
Name: date, Length: 10683, dtype: object

In [21]:
df["Date"] = df['date'].astype(int)

In [23]:
df["Date"]

0        24
1         1
2         9
3        12
4         1
         ..
10678     9
10679    27
10680    27
10681     1
10682     9
Name: Date, Length: 10683, dtype: int32

In [24]:
df["month"] = df['Month'].astype(int)

In [25]:
df["month"]

0        3
1        5
2        6
3        5
4        3
        ..
10678    4
10679    4
10680    4
10681    3
10682    5
Name: month, Length: 10683, dtype: int32

In [27]:
df["year"] = df['Year'].astype(int)

In [28]:
df["year"]

0        2019
1        2019
2        2019
3        2019
4        2019
         ...
10678    2019
10679    2019
10680    2019
10681    2019
10682    2019
Name: year, Length: 10683, dtype: int32

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
 11  date             10683 non-null  object
 12  Month            10683 non-null  object
 13  Year             10683 non-null  object
 14  Date             10683 non-null  int32
 15  month            10683 non-null  int32
 16  year             10683 non-null  int32
dtypes: int32(3), int64(1), object(13)
memory usage: 1.3+ MB

In [34]:
df.drop('Date_of_Journey', axis = 1 , inplace = True)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Arrival_Time     10683 non-null  object
 6   Duration         10683 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10683 non-null  object
 9   Price            10683 non-null  int64
 10  date             10683 non-null  object
 11  Month            10683 non-null  object
 12  Year             10683 non-null  object
 13  Date             10683 non-null  int32
 14  month            10683 non-null  int32
 15  year             10683 non-null  int32
dtypes: int32(3), int64(1), object(12)
memory usage: 1.2+ MB

In [36]:
df.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,Month,Year,Date,month,year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,03,2019,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,05,2019,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,9,06,2019,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,12,05,2019,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,01,03,2019,1,3,2019

In [38]:
df['Arrival_Time'] =  df['Arrival_Time'].apply(lambda x: x.split(' ')[0])

In [50]:
df['Arrival_Time']

0        01:10
1        13:15
2        04:25
3        23:30
4        21:35
         ...
10678    22:25
10679    23:20
10680    11:20
10681    14:10
10682    19:15
Name: Arrival_Time, Length: 10683, dtype: object

In [58]:
df['Arrival_hour'] = df['Arrival_Time'].str.split(':').str[0]

In [59]:
df['Arrival_min'] = df['Arrival_Time'].str.split(':').str[1]

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Arrival_Time     10683 non-null  object
 6   Duration         10683 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10683 non-null  object
 9   Price            10683 non-null  int64
 10  date             10683 non-null  object
 11  Month            10683 non-null  object
 12  Year             10683 non-null  object
 13  Date             10683 non-null  int32
 14  month            10683 non-null  int32
 15  year             10683 non-null  int32
 16  Arrival_min      0 non-null      float64
 17  Arrival_hour     10683 non-null  object
dtypes: float64(1), int32(3), int64(1), object(13)
memory usage: 1.3+ MB

In [63]:
df['Arrival_hour'] = df['Arrival_hour'].fillna(0).astype(int)
df['Arrival_min'] = df['Arrival_min'].fillna(0).astype(int)

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Arrival_Time     10683 non-null  object
 6   Duration         10683 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10683 non-null  object
 9   Price            10683 non-null  int64
 10  date             10683 non-null  object
 11  Month            10683 non-null  object
 12  Year             10683 non-null  object
 13  Date             10683 non-null  int32
 14  month            10683 non-null  int32
 15  year             10683 non-null  int32
 16  Arrival_min      10683 non-null  int32
 17  Arrival_hour     10683 non-null  int32
dtypes: int32(5), int64(1), object(12)
memory usage: 1.3+ MB

In [67]:
df.drop('Arrival_Time', axis=1, inplace = True)

In [68]:
df.sample()

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,date,Month,Year,Date,month,year,Arrival_min,Arrival_hour
7479,Multiple carriers,Delhi,Cochin,DEL → HYD → COK,07:10,15h 10m,1 stop,No info,6145,27,03,2019,27,3,2019,0,22

In [100]:
df['Dept_hour'] = df['Dep_Time'].str.split(':').str[0]
df['Dept_min'] = df['Dep_Time'].str.split(':').str[1]

In [101]:
df.sample(2)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,date,...,Year,Date,month,year,Arrival_min,Arrival_hour,Dep_hour,Dep_min,Dept_hour,Dept_min
4914,SpiceJet,Kolkata,Banglore,CCU → BLR,06:55,2h 35m,non-stop,No check-in baggage included,3841,27,...,2019,27,5,2019,0,9,6,6,06,55
8170,Jet Airways,Banglore,New Delhi,BLR → BOM → DEL,08:55,24h 5m,1 stop,No info,15025,06,...,2019,6,3,2019,0,9,8,8,08,55

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  object
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   date             10683 non-null  object
 10  Month            10683 non-null  object
 11  Year             10683 non-null  object
 12  Date             10683 non-null  int32
 13  month            10683 non-null  int32
 14  year             10683 non-null  int32
 15  Arrival_min      10683 non-null  int32
 16  Arrival_hour     10683 non-null  int32
 17  Dep_hour         10683 non-null  int32
 18  Dep_min          10683 non-null  int32
 19  Dept_hour        10683 non-null  object
 20  Dept_min         10683 non-null  object
dtypes: int32(7), int64(1), object(13)
memory usage: 1.4+ MB

In [104]:
df['Dept_hour'] = df['Dept_hour'].astype(int)
df['Dept_min'] = df['Dept_hour'].astype(int)

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  object
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   date             10683 non-null  object
 10  Month            10683 non-null  object
 11  Year             10683 non-null  object
 12  Date             10683 non-null  int32
 13  month            10683 non-null  int32
 14  year             10683 non-null  int32
 15  Arrival_min      10683 non-null  int32
 16  Arrival_hour     10683 non-null  int32
 17  Dep_hour         10683 non-null  int32
 18  Dep_min          10683 non-null  int32
 19  Dept_hour        10683 non-null  int32
 20  Dept_min         10683 non-null  int32
dtypes: int32(9), int64(1), object(11)
memory usage: 1.3+ MB

In [107]:
df.drop('Dep_Time', axis = 1 , inplace = True)

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Year             10683 non-null  object
 9   Date             10683 non-null  int32
 10  month            10683 non-null  int32
 11  Arrival_min      10683 non-null  int32
 12  Arrival_hour     10683 non-null  int32
 13  Dep_hour         10683 non-null  int32
 14  Dep_min          10683 non-null  int32
 15  Dept_hour        10683 non-null  int32
 16  Dept_min         10683 non-null  int32
dtypes: int32(8), int64(1), object(8)
memory usage: 1.1+ MB

In [123]:
df['Year'].astype(int)

0        2019
1        2019
2        2019
3        2019
4        2019
         ...
10678    2019
10679    2019
10680    2019
10681    2019
10682    2019
Name: Year, Length: 10683, dtype: int32

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Year             10683 non-null  object
 9   Date             10683 non-null  int32
 10  month            10683 non-null  int32
 11  Arrival_min      10683 non-null  int32
 12  Arrival_hour     10683 non-null  int32
 13  Dep_hour         10683 non-null  int32
 14  Dep_min          10683 non-null  int32
 15  Dept_hour        10683 non-null  int32
 16  Dept_min         10683 non-null  int32
dtypes: int32(8), int64(1), object(8)
memory usage: 1.1+ MB

In [133]:
df["year"] = df["Year"].str.split(':').str[0]

In [134]:
df["year"]

0        2019
1        2019
2        2019
3        2019
4        2019
         ...
10678    2019
10679    2019
10680    2019
10681    2019
10682    2019
Name: year, Length: 10683, dtype: object

In [135]:
df["year"].astype(int)

0        2019
1        2019
2        2019
3        2019
4        2019
         ...
10678    2019
10679    2019
10680    2019
10681    2019
10682    2019
Name: year, Length: 10683, dtype: int32

In [122]:
df.sample(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Year,Date,month,Arrival_min,Arrival_hour,Dep_hour,Dep_min,Dept_hour,Dept_min
3693,Jet Airways,Kolkata,Banglore,CCU → BOM → BLR,7h 5m,1 stop,No info,14571,2019,9,6,0,23,16,16,16,16
8010,IndiGo,Delhi,Cochin,DEL → BOM → COK,14h 5m,1 stop,No info,6270,2019,9,4,0,1,11,11,11,11

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Date             10683 non-null  int32
 9   month            10683 non-null  int32
 10  Arrival_min      10683 non-null  int32
 11  Arrival_hour     10683 non-null  int32
 12  Dep_hour         10683 non-null  int32
 13  Dep_min          10683 non-null  int32
 14  Dept_hour        10683 non-null  int32
 15  Dept_min         10683 non-null  int32
 16  year             10683 non-null  object
dtypes: int32(8), int64(1), object(8)
memory usage: 1.1+ MB

In [145]:
df["Year"] = df['year'].astype(int)

In [147]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Date             10683 non-null  int32
 9   month            10683 non-null  int32
 10  Arrival_min      10683 non-null  int32
 11  Arrival_hour     10683 non-null  int32
 12  Dep_hour         10683 non-null  int32
 13  Dep_min          10683 non-null  int32
 14  Dept_hour        10683 non-null  int32
 15  Dept_min         10683 non-null  int32
 16  year             10683 non-null  object
 17  Year             10683 non-null  int32
dtypes: int32(9), int64(1), object(8)
memory usage: 1.1+ MB

In [146]:
df.sample(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,month,Arrival_min,Arrival_hour,Dep_hour,Dep_min,Dept_hour,Dept_min,year,Year
410,Air India,Delhi,Cochin,DEL → HYD → BOM → COK,26h,2 stops,No info,12392,18,5,0,19,17,17,17,17,2019,2019
10533,Jet Airways,Banglore,New Delhi,BLR → DEL,2h 40m,non-stop,No info,7229,24,3,0,22,19,19,19,19,2019,2019

In [148]:
df.drop('year', axis = 1 , inplace = True)

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Date             10683 non-null  int32
 9   month            10683 non-null  int32
 10  Arrival_min      10683 non-null  int32
 11  Arrival_hour     10683 non-null  int32
 12  Dep_hour         10683 non-null  int32
 13  Dep_min          10683 non-null  int32
 14  Dept_hour        10683 non-null  int32
 15  Dept_min         10683 non-null  int32
 16  Year             10683 non-null  int32
dtypes: int32(9), int64(1), object(7)
memory usage: 1.0+ MB

In [150]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [151]:
df['Total_Stops'].isnull().sum()

1

In [153]:
df[df['Total_Stops'].isnull()]

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,month,Arrival_min,Arrival_hour,Dep_hour,Dep_min,Dept_hour,Dept_min,Year
9039,Air India,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480,6,5,0,9,9,9,9,9,2019

In [154]:
df['Total_Stops'].mode()

0    1 stop
Name: Total_Stops, dtype: object

In [157]:
df['Total_Stops']= df['Total_Stops'].map({'non-stop':0, '1 stop':1, '2 stops':2, '3 stops':3, '4 stops':4,np.nan:1})

In [160]:
df['Total_Stops'].isnull().sum()

0

In [161]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10683 non-null  object
 5   Total_Stops      10683 non-null  int64
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Date             10683 non-null  int32
 9   month            10683 non-null  int32
 10  Arrival_min      10683 non-null  int32
 11  Arrival_hour     10683 non-null  int32
 12  Dep_hour         10683 non-null  int32
 13  Dep_min          10683 non-null  int32
 14  Dept_hour        10683 non-null  int32
 15  Dept_min         10683 non-null  int32
 16  Year             10683 non-null  int32
dtypes: int32(9), int64(2), object(6)
memory usage: 1.0+ MB

In [162]:
df.drop('Route', axis = 1, inplace = True)

In [163]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Duration         10683 non-null  object
 4   Total_Stops      10683 non-null  int64
 5   Additional_Info  10683 non-null  object
 6   Price            10683 non-null  int64
 7   Date             10683 non-null  int32
 8   month            10683 non-null  int32
 9   Arrival_min      10683 non-null  int32
 10  Arrival_hour     10683 non-null  int32
 11  Dep_hour         10683 non-null  int32
 12  Dep_min          10683 non-null  int32
 13  Dept_hour        10683 non-null  int32
 14  Dept_min         10683 non-null  int32
 15  Year             10683 non-null  int32
dtypes: int32(9), int64(2), object(5)
memory usage: 959.9+ KB

In [164]:
df['Duration']

0        2h 50m
1        7h 25m
2           19h
3        5h 25m
4        4h 45m
          ...
10678    2h 30m
10679    2h 35m
10680        3h
10681    2h 40m
10682    8h 20m
Name: Duration, Length: 10683, dtype: object

In [166]:
df['Duration_hours']= df['Duration'].str.split(' ').str[0].str.split(' ').str[0].str.split('h').str[0]

In [167]:
df['Duration_hours']

0         2
1         7
2        19
3         5
4         4
         ..
10678     2
10679     2
10680     3
10681     2
10682     8
Name: Duration_hours, Length: 10683, dtype: object

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Duration         10683 non-null  object
 4   Total_Stops      10683 non-null  int64
 5   Additional_Info  10683 non-null  object
 6   Price            10683 non-null  int64
 7   Date             10683 non-null  int32
 8   month            10683 non-null  int32
 9   Arrival_min      10683 non-null  int32
 10  Arrival_hour     10683 non-null  int32
 11  Dep_hour         10683 non-null  int32
 12  Dep_min          10683 non-null  int32
 13  Dept_hour        10683 non-null  int32
 14  Dept_min         10683 non-null  int32
 15  Year             10683 non-null  int32
 16  Duration_hours   10683 non-null  object
dtypes: int32(9), int64(2), object(6)
memory usage: 1.0+ MB

In [170]:
df.Airline.unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [172]:
df.Source.unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [174]:
from sklearn.preprocessing import OneHotEncoder

In [179]:
encoder = OneHotEncoder()

In [180]:
df.columns

Index(['Airline', 'Source', 'Destination', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price', 'Date', 'month', 'Arrival_min',
       'Arrival_hour', 'Dep_hour', 'Dep_min', 'Dept_hour', 'Dept_min', 'Year',
       'Duration_hours'],
      dtype='object')

In [182]:
encoder.fit_transform(df[['Airline', 'Source', 'Destination']]).toarray()

array([[0., 0., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 0., 0., 0.]])

In [183]:
pd.DataFrame(encoder.fit_transform(df[['Airline', 'Source', 'Destination']]).toarray(), columns = encoder.get_feature_names_out())

,Airline_Air Asia,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Trujet,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10678,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
10679,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
10680,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
10681,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
10682,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Duration         10683 non-null  object
 4   Total_Stops      10683 non-null  int64
 5   Additional_Info  10683 non-null  object
 6   Price            10683 non-null  int64
 7   Date             10683 non-null  int32
 8   month            10683 non-null  int32
 9   Arrival_min      10683 non-null  int32
 10  Arrival_hour     10683 non-null  int32
 11  Dep_hour         10683 non-null  int32
 12  Dep_min          10683 non-null  int32
 13  Dept_hour        10683 non-null  int32
 14  Dept_min         10683 non-null  int32
 15  Year             10683 non-null  int32
 16  Duration_hours   10683 non-null  object
dtypes: int32(9), int64(2), object(6)
memory usage: 1.0+ MB

In [187]:
df.drop('Airline',axis = 1, inplace = True)
df.drop('Source',axis = 1, inplace = True)
df.drop('Destination',axis = 1, inplace = True)

In [188]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Duration         10683 non-null  object
 1   Total_Stops      10683 non-null  int64
 2   Additional_Info  10683 non-null  object
 3   Price            10683 non-null  int64
 4   Date             10683 non-null  int32
 5   month            10683 non-null  int32
 6   Arrival_min      10683 non-null  int32
 7   Arrival_hour     10683 non-null  int32
 8   Dep_hour         10683 non-null  int32
 9   Dep_min          10683 non-null  int32
 10  Dept_hour        10683 non-null  int32
 11  Dept_min         10683 non-null  int32
 12  Year             10683 non-null  int32
 13  Duration_hours   10683 non-null  object
dtypes: int32(9), int64(2), object(3)
memory usage: 793.0+ KB

In [189]:
df.sample(2)

,Duration,Total_Stops,Additional_Info,Price,Date,month,Arrival_min,Arrival_hour,Dep_hour,Dep_min,Dept_hour,Dept_min,Year,Duration_hours
9693,11h 15m,1,No info,6171,27,3,0,16,4,4,4,4,2019,11
8463,13h 55m,1,No info,6442,1,6,0,22,8,8,8,8,2019,13